app/controllers/admin/menus_controller.rb

    def index
      @menus = Menu.all
---
SELECT "menus".* FROM "menus"

    def edit
     @menu = Menu.find(params[:id])
---
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", 3]]

    def create
      @menu = Menu.new(menu_params)

      respond_to do |format|
        if @menu.save
---
INSERT INTO "menus" ("name", "url", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "منوی اصلی"], ["url", "/about-us"], ["description", ""], ["created_at", "2016-09-01 14:24:45.321178"], ["updated_at", "2016-09-01 14:24:45.321178"]]

    def update
      respond_to do |format|
        if @menu.update(menu_params)
---
UPDATE "menus" SET "url" = ?, "updated_at" = ? WHERE "menus"."id" = ?  [["url", "http://google.com"], ["updated_at", "2016-09-01 14:26:13.208284"], ["id", 3]]

      def set_menu
        @menu = Menu.find(params[:id])
---
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = ? LIMIT 1  [["id", 3]]