app/controllers/admin/posts_controller.rb

SELECT  "posts".* FROM "posts"  ORDER BY created_at DESC LIMIT 5 OFFSET 0
---
    def index
      @posts = Post.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 5)

INSERT INTO "posts" ("title", "body", "category_id", "publish_date_time", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
      @post = current_user.posts.build(post_params)

      respond_to do |format|
        if @post.save