app/views/shared/_home_header.html.erb

                    <ul class="nav navbar-nav">
                    <% Menu.all.each do |menu| %>
                        <% if menu.mitems.present? %>
---
SELECT "menus".* FROM "menus"
SELECT "mitems".* FROM "mitems" WHERE "mitems"."menu_id" = ?  [["menu_id", 1]]