app/controllers/blog_controller.rb

	def index
		@posts = Post.where(:published => true).order("created_at DESC").
		paginate(:page => params[:page], :per_page => 5)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."published" = ?  ORDER BY created_at DESC LIMIT 5 OFFSET 0  [["published", "t"]]