app/views/admin/menus/_edit.html.erb

          <ul>
          <% Menu.all.each do |menu| %>
---
SELECT "menus".* FROM "menus"

              <ul>
                <% menu.mitems.each do |item| %>
---
SELECT "mitems".* FROM "mitems" WHERE "mitems"."menu_id" = ?  [["menu_id", 1]]